{
  "property": {
    "name": "Whare Tui Lodge",
    "tagline": "Lakefront Retreat",
    "location": {
      "area": "Glendhu Bay",
      "town": "Wanaka",
      "region": "Otago",
      "country": "New Zealand",
      "latitude": -44.68,
      "longitude": 169.05
    },
    "type": "Entire Lodge",
    "maxGuests": 12,
    "bedrooms": 6,
    "bathrooms": 7,
    "minStay": 3,
    "nearbyDistances": "15 minutes' drive to Wanaka township. 5 minutes to Roys Peak trailhead. 35 minutes to Cardrona Alpine Resort. 15 minutes to Treble Cone ski area. 10 minutes to Rippon Vineyard. 1 hour to Queenstown. 1 hour to Queenstown Airport (ZQN)."
  },

  "pricing": {
    "nightlyRate": 1200,
    "cleaningFee": 350
  },

  "host": {
    "names": "Tom & Aroha Mitchell",
    "bio": "We bought this former sheep station in 2003 and spent two decades turning it into a lodge. Born and raised in Otago — Aroha grew up in Cromwell, I'm from Dunedin. We manage the property ourselves, no management company, no agency. You deal with us.",
    "responseTime": "<45m",
    "totalStays": 200
  },

  "description": [
    "Whare Tui Lodge sits on the shores of Lake Wanaka at Glendhu Bay, with uninterrupted views of the Southern Alps and Mt Aspiring National Park. Built on a former sheep station dating to the 1870s, we transformed the land over two decades — planting over 8,000 trees including silver birch, kowhai, native flax, and toi-toi alongside the original beech forest.",
    "The architecture draws on clean timber-and-glass design — floor-to-ceiling double-glazed windows frame the lake and mountains from every room. Six spacious suites each have en-suite bathrooms with underfloor heating, walk-in rain showers, and deep soaking tubs positioned with views of the ranges. The open-plan living area centres around a stone fireplace, with the chef's kitchen opening directly onto the outdoor entertaining deck.",
    "This is our home. We converted it to exclusive-use because we believe the best way to experience Wanaka is with the whole lodge to yourself — not room-by-room in a hotel. Aroha handles the itineraries and local tips, I sort the logistics. No front desk, no corporate script. Just two Kiwis who know this place inside and out."
  ],

  "amenities": [
    "Outdoor hot tub (lakeside, mountain views)",
    "Stone fireplace in main living area",
    "Chef's kitchen (or private chef on request)",
    "Guest bar & wine cellar",
    "High-speed WiFi & Sky TV throughout",
    "Billiards room with full-size snooker table",
    "Ski storage & drying room",
    "Free parking (4 vehicles)",
    "Outdoor deck with chimenea & gas BBQ",
    "Underfloor heating in all en-suites",
    "Direct lake access & kayaks",
    "Helipad (pre-approved, heli-ski transfers)"
  ],

  "images": {
    "photos": [
      { "url": "https://images.unsplash.com/photo-1529023971088-2d8a13c1d937?w=1200&q=80", "label": "Lake Wanaka & Southern Alps" },
      { "url": "https://images.unsplash.com/photo-1600585154340-be6161a56a0c?w=800&q=80", "label": "Main Living Area" },
      { "url": "https://images.unsplash.com/photo-1547743803-bbba9d982c9e?w=800&q=80", "label": "The Wanaka Tree" },
      { "url": "https://images.unsplash.com/photo-1699575947488-30f08e71896b?w=800&q=80", "label": "Bush Walking Track" },
      { "url": "https://images.unsplash.com/photo-1696860741307-72ccbb7826da?w=800&q=80", "label": "Outdoor Hot Tub" },
      { "url": "https://images.unsplash.com/photo-1618221195710-dd6b41faaea6?w=800&q=80", "label": "Kitchen" },
      { "url": "https://images.unsplash.com/photo-1560448204-e02f11c3d0e2?w=800&q=80", "label": "Bedroom 1 — Master Suite" },
      { "url": "https://images.unsplash.com/photo-1552321554-5fefe8c9ef14?w=800&q=80", "label": "Bedroom 2 — Lake View" },
      { "url": "https://images.unsplash.com/photo-1584622650111-993a426fbf0a?w=800&q=80", "label": "Bathroom 1 — En-suite" },
      { "url": "https://images.unsplash.com/photo-1600607687939-ce8a6c25118c?w=800&q=80", "label": "Outdoor Deck & BBQ" },
      { "url": "https://images.unsplash.com/photo-1486870591958-9b9d0d1dda99?w=800&q=80", "label": "Things To Do — Roys Peak" }
    ]
  },

  "houseRules": {
    "checkIn": "3:00 PM",
    "checkOut": "10:00 AM",
    "rules": "Shoes off indoors (Kiwi custom — we provide slippers). No smoking anywhere on the property (Smokefree Environments Act). No pets. Quiet hours after 10:00 PM (rural setting). Maximum 12 overnight guests. Shower before using the hot tub, no glassware in the spa area. Respect native bush and birdlife on the grounds. Separate recycling per Queenstown Lakes District Council guidelines."
  },

  "cancellation": "Full refund if cancelled 21+ days before check-in. 50% refund if cancelled 10–21 days before. No refund within 10 days. Peak season (20 Dec – 10 Jan) requires 30 days' notice for full refund.",

  "reviews": [
    {
      "name": "Emma R.",
      "date": "January 2026",
      "note": "Escrow Protected Stay",
      "photoVerified": true,
      "checklist": ["Amenities accurate", "Location accurate", "Photos match reality", "Cleanliness confirmed", "Host responsive"],
      "text": "Genuinely one of the most beautiful places I've ever stayed. Woke up to mist rolling off the lake with the mountains behind it — every single morning. Tom arranged a heli-ski trip to the Harris Mountains for my husband and Aroha left us a welcome platter with local cheeses from Gibbston. The hot tub under the stars was the highlight. No surprise fees, no nonsense — just two lovely people sharing their incredible home."
    },
    {
      "name": "David & Lin C.",
      "date": "November 2025",
      "note": "2nd stay with this host",
      "photoVerified": true,
      "checklist": ["Amenities accurate", "Location accurate", "Photos match reality", "Cleanliness confirmed", "Host responsive"],
      "text": "Second time booking through StayDirect with Tom and Aroha. Brought the extended family this time — 10 of us — and the lodge handled it effortlessly. The kids loved the billiards room, adults loved the fireplace and Rippon wines. We saved over NZ$1,200 compared to what Booking quoted us for the same dates. The direct relationship makes everything better — Aroha even booked us a private wine tour in Cromwell."
    },
    {
      "name": "Hana W.",
      "date": "September 2025",
      "note": "Escrow Protected Stay",
      "photoVerified": true,
      "checklist": ["Amenities accurate", "Location accurate", "Photos match reality", "Cleanliness confirmed", "Host responsive"],
      "neutralTags": ["Minor maintenance note"],
      "text": "Stunning property. The Roys Peak track is basically on the doorstep. One of the bathroom underfloor heaters wasn't working in suite 4 — messaged Tom directly and he had a sparky out within two hours. That kind of responsiveness is why we'll never go back to faceless platforms. Everything else was absolutely perfect.",
      "resolution": "Issue was resolved privately before any negative review feeds into the property rating. Guest updated their checklist after fix."
    }
  ]
}
